// https://www.notion.so/2ca2913a77d18079b27fe47df5990387

export const ExplicitLanguageList = [
  {
    "length": 1,
    "words": ["좆", "씹"],
    "replacement": ["귤"]
  },
  {
    "length": 2,
    "words": [
      "시발", "씨발", "지랄",
      "애미", "애비", "병신",
      "호모", "레즈", "트젠",
      "좆창", "좆도", "좆나",
      "좆밥", "씹새", "씹년",
      "씹련", "썅년", "썅놈",
      "창년", "씹남", "좆남",
      "븅신", "암캐",
    ],
    "replacement": ["푸딩"]
  },
  {
    "length": 3,
    "words": [
      "시발놈", "씨발놈", "씨발년",
      "니애미", "니애비", "느금마",
      "느개비", "느개미", "개병신",
      "페미충", "김치녀", "김치년",
      "된장녀", "된장년", "보지녀",
      "보지년", "한남충", "개한남",
      "씹한남", "게이년", "레즈충",
      "레즈년", "비언년", "트젠충",
      "트젠년", "개지랄", "좆같다",
      "씹새끼", "씨방새", "미친년",
      "미친놈", "병신년", "걸레녀",
      "걸레년", "암캐년", "페미년",
      "창녀년", "게이질", "항문충",
      "똥꼬충"
    ],
    "replacement": ["밤푸딩", "팥푸딩"]
  },
  {
    "length": 4,
    "words": [
      "호로자식", "한남민국", "레즈새끼",
      "동성애년", "트젠새끼", "미친새끼",
      "미친새기", "병신새끼","병신새기",
      "호로새끼","개호로놈", "장애새끼",
      "장애새기"
    ],
    "replacement": ["우유푸딩", "초코푸딩", "말차푸딩", "두유푸딩"]
  },
  {
    "length": 5,
    "words": [
      "빌어먹을놈", "빌어먹을년", "한남스러움",
      "장애인새끼", "장애인새기", "미치광이년",
      "미치광이련", "성전환괴물"
    ],
    "replacement": ["카라멜푸딩", "밀크티푸딩"]
  },
  {
    "length": 6,
    "words": [
      "동성애자새끼"
    ],
    "replacement": [
        "순수우유푸딩", "라즈베리푸딩", "얼그레이푸딩",
        "얼그레이푸딩", "제주말차푸딩", "커스터드푸딩",
        "딸기크림푸딩",
    ]
  }
];